In [4]:
import pandas as pd

In [6]:
data2 = {
    'employee_id': [2, 3, 7, 8, 9],
    'name': ['Ashu', 'Mihir', 'Adi', 'Junan', 'Kannon'],
    'salary': [3000, 3800, 7400, 6100, 7700]
}
employees_df = pd.DataFrame(data2)

print("Original DataFrame:")
print(employees_df)
print("\n")

Original DataFrame:
   employee_id    name  salary
0            2    Ashu    3000
1            3   Mihir    3800
2            7     Adi    7400
3            8   Junan    6100
4            9  Kannon    7700

In [8]:
# 1. Select 'name' and 'salary' columns
name_salary = employees_df[['name', 'salary']]
print("\nNames and Salaries:\n")
print(name_salary)
print("\n")

Names and Salaries:

     name  salary
0    Ashu    3000
1   Mihir    3800
2     Adi    7400
3   Junan    6100
4  Kannon    7700

#####  Filter rows based on a condition:

In [13]:
# Employees with salary greater than 5000
high_earners = employees_df[employees_df['salary'] > 5000] 
print("Employees with salary > 5000:")
print(high_earners)
print("\n")

Employees with salary > 5000:
   employee_id    name  salary
2            7     Adi    7400
3            8   Junan    6100
4            9  Kannon    7700

In [15]:
# Employees named 'Adi'
adi = employees_df[employees_df['name'] == 'Adi']
print("Employee named 'Adi':")
print(adi)
print("\n")

Employee named 'Adi':
   employee_id name  salary
2            7  Adi    7400

#####  Filter rows based on multiple conditions (AND, OR):

In [18]:
mid_range_salary = employees_df[(employees_df['salary'] >= 3000) & (employees_df['salary'] <= 7000)]
print("Employees with salary between 3000 and 7000:")
print(mid_range_salary)
print("\n")

Employees with salary between 3000 and 7000:
   employee_id   name  salary
0            2   Ashu    3000
1            3  Mihir    3800
3            8  Junan    6100

In [20]:
# Employees named 'Ashu' OR 'Kannon'
specific_names = employees_df[(employees_df['name'] == 'Ashu') | (employees_df['name'] == 'Kannon')]
print("Employees named 'Ashu' or 'Kannon':")
print(specific_names)
print("\n")

Employees named 'Ashu' or 'Kannon':
   employee_id    name  salary
0            2    Ashu    3000
4            9  Kannon    7700

##### Sort the DataFrame:

In [27]:
# Sort by salary in ascending order
sorted_salary_asc = employees_df.sort_values(by='salary')
print("Employees sorted by salary (ascending):")
print(sorted_salary_asc)
print("\n")

Employees sorted by salary (ascending):
   employee_id    name  salary
0            2    Ashu    3000
1            3   Mihir    3800
3            8   Junan    6100
2            7     Adi    7400
4            9  Kannon    7700

In [29]:
# Sort by salary in descending order
sorted_salary_desc = employees_df.sort_values(by='salary', ascending=False)
print("Employees sorted by salary (descending):")
print(sorted_salary_desc)
print("\n")

Employees sorted by salary (descending):
   employee_id    name  salary
4            9  Kannon    7700
2            7     Adi    7400
3            8   Junan    6100
1            3   Mihir    3800
0            2    Ashu    3000

#####  Get descriptive statistics:

In [34]:
# Descriptive statistics for salary
salary_statistics = employees_df['salary'].describe()
print("Salary Statistics:")
print(salary_statistics) 
print("\n")

Salary Statistics:
count       5.00000
mean     5600.00000
std      2115.41958
min      3000.00000
25%      3800.00000
50%      6100.00000
75%      7400.00000
max      7700.00000
Name: salary, dtype: float64

##### Case Conversion

In [45]:
# Convert product names to lowercase
employees_df['names_lower'] = employees_df['name'].str.lower()
print("Product Names in (Lowercase):")
print(employees_df[['name', 'names_lower']])
print("\n")

Product Names in (Lowercase):
     name names_lower
0    Ashu        ashu
1   Mihir       mihir
2     Adi         adi
3   Junan       junan
4  Kannon      kannon

In [49]:
# Capitalize   
employees_df['names_capialize'] = employees_df['name'].str.capitalize()
print("Product Names in (capitalize):")
print(employees_df[['name', 'names_capialize']])
print("\n")

Product Names in (capitalize):
     name names_capialize
0    Ashu            Ashu
1   Mihir           Mihir
2     Adi             Adi
3   Junan           Junan
4  Kannon          Kannon

####  Vectorized Operations

<b>Arithmetic Operations</b>

In [54]:
# Give every employee a 10% raise 
employees_df['salary_after_raise'] = employees_df['salary'] * 1.10
print("Salaries after 10% raise:")
print(employees_df[['name', 'salary', 'salary_after_raise']])
print("\n")

Salaries after 10% raise:
     name  salary  salary_after_raise
0    Ashu    3000              3300.0
1   Mihir    3800              4180.0
2     Adi    7400              8140.0
3   Junan    6100              6710.0
4  Kannon    7700              8470.0

In [58]:
# Calculate a bonus of 500 for everyone
employees_df['bonus_salary'] = employees_df['salary'] + 1000
print("Salaries with a 1000 bonus:")
print(employees_df[['name', 'salary', 'bonus_salary']])
print("\n")

Salaries with a 1000 bonus:
     name  salary  bonus_salary
0    Ashu    3000          4000
1   Mihir    3800          4800
2     Adi    7400          8400
3   Junan    6100          7100
4  Kannon    7700          8700

##### Fix strings in Proper format

In [12]:
# 1. Create the DataFrame  
data3 = {'user_id': [2, 1],
        'name': ['aShu', 'mIHir']}
users_df = pd.DataFrame(data3)

print("Original DataFrame:")
print(users_df)

Original DataFrame:
   user_id   name
0        2   aShu
1        1  mIHir

In [38]:
# 2. Capitalize the 'name' column 
users_df['name'] = users_df['name'].str.capitalize()

print("\nDataFrame with capitalized names:")
print(users_df)

DataFrame with capitalized names:
   user_id   name
0        2   Ashu
1        1  Mihir

In [40]:
# 3. Sort the DataFrame by 'user_id' 
users_df_sorted = users_df.sort_values(by='user_id')

print("\nDataFrame Sorted by User ID:")
print(users_df_sorted)

DataFrame Sorted by User ID:
   user_id   name
1        1  Mihir
0        2   Ashu